In [68]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [7]:
s = pd.Series([1,2,3,4], index=['天', '地', '玄', '黄'])
s

天    1
地    2
玄    3
黄    4
dtype: int64

In [24]:
data1 = {'姓':['赵', '王', '张', '王'],
        '名':['小伟','小唐','小吴','小乖'],
        '民族':['汉', '汉','汉', '汉'],
       '年龄':[3,1,1,3]}
print(data)

{'姓': ['赵', '王', '张'], '名': ['小伟', '小唐', '小吴', '小乖'], '名族': ['汉', '汉', '汉', '汉'], '年龄': [3, 1, None]}

In [22]:
df = pd.DataFrame([['赵', '王','张'],['小吴','自爱','自取','其中'],['汉', '汉', '汉', '汉'],[3,2,3,2]], columns=['姓', '名', '名族', '年龄' ])
df

    姓   名  名族    年龄
0   赵   王   张  None
1  小吴  自爱  自取    其中
2   汉   汉   汉     汉
3   3   2   3     2

In [26]:
df = pd.DataFrame(data1,columns=['姓', '名', '民族', '年龄' ] )
df

   姓   名 民族  年龄
0  赵  小伟  汉   3
1  王  小唐  汉   1
2  张  小吴  汉   1
3  王  小乖  汉   3

In [27]:
user = pd.Series(data=[18,30,25, 50])
user

0    18
1    30
2    25
3    50
dtype: int64

In [28]:
user.index = ['tom','bob','mary','james']

In [29]:
user

tom      18
bob      30
mary     25
james    50
dtype: int64

In [30]:
user.index.name='name'
user

name
tom      18
bob      30
mary     25
james    50
dtype: int64

In [31]:
user.name='user_age_info'
user

name
tom      18
bob      30
mary     25
james    50
Name: user_age_info, dtype: int64

In [32]:
# 构建索引
name = pd.Index(['tom','jkd','jfla','dfj'],name="name")
# 构建 Series
user_age = pd.Series(data=[22,3,41,32], index=name,name='zhaoweizheng')
user_age

name
tom     22
jkd      3
jfla    41
dfj     32
Name: zhaoweizheng, dtype: int64

In [33]:
user_age['tom']

22

In [36]:
user_age.get('tom')

22

In [37]:
user_age[0]

22

In [38]:
user_age[:3]

name
tom     22
jkd      3
jfla    41
Name: zhaoweizheng, dtype: int64

In [39]:
user_age[user_age>30]

name
jfla    41
dfj     32
Name: zhaoweizheng, dtype: int64

In [45]:
user_age[[3,2]]

name
dfj     32
jfla    41
Name: zhaoweizheng, dtype: int64

In [41]:
user_age

name
tom     22
jkd      3
jfla    41
dfj     32
Name: zhaoweizheng, dtype: int64

In [46]:
user_age + 1

name
tom     23
jkd      4
jfla    42
dfj     33
Name: zhaoweizheng, dtype: int64

In [47]:
np.exp(user_age)

NameError: name 'np' is not defined

In [48]:
user_age = pd.Series(data=[[22,3,41,32],[22,3,41,32],[22,3,41,32],], index=['a','b','c'],name='zhaoweizheng')
user_age

a    [22, 3, 41, 32]
b    [22, 3, 41, 32]
c    [22, 3, 41, 32]
Name: zhaoweizheng, dtype: object

In [49]:
index = pd.Index(data=['tom','bob','mary','james'],name='zhaoweizheng')
data = {
    'age':[18,30,25,40],
    'city':['bz','hz','gz','sz']
}
user_data = pd.DataFrame(data=data, index = index)
user_data

              age city
zhaoweizheng
tom            18   bz
bob            30   hz
mary           25   gz
james          40   sz

In [52]:
user_data.loc['tom']

age     18
city    bz
Name: tom, dtype: object

In [53]:
user_data.iloc[0]

age     18
city    bz
Name: tom, dtype: object

In [54]:
user_data.iloc[1:3]

              age city
zhaoweizheng
bob            30   hz
mary           25   gz

In [55]:
user_data.age

zhaoweizheng
tom      18
bob      30
mary     25
james    40
Name: age, dtype: int64

In [59]:
user_data[['city', 'age']]

             city  age
zhaoweizheng
tom            bz   18
bob            hz   30
mary           gz   25
james          sz   40

In [60]:
user_data['sex']='male'

In [61]:
user_data

              age city   sex
zhaoweizheng
tom            18   bz  male
bob            30   hz  male
mary           25   gz  male
james          40   sz  male

In [62]:
user_data.pop('sex')

zhaoweizheng
tom      male
bob      male
mary     male
james    male
Name: sex, dtype: object

In [63]:
user_info["sex"] = ["male", "male", "female", "male"]

NameError: name 'user_info' is not defined

In [64]:
user_data["sex"] = ["male", "male", "female", "male"]

In [65]:
user_data

              age city     sex
zhaoweizheng
tom            18   bz    male
bob            30   hz    male
mary           25   gz  female
james          40   sz    male

In [66]:
user_data.assign(age_add_one = user_data['age' + 1])

TypeError: can only concatenate str (not "int") to str

In [69]:
index = pd.Index(data=["Tom", "Bob", "Mary", "James"], name="name")

data = {
    "age": [18, 30, 25, 40],
    "city": ["BeiJing", "ShangHai", "GuangZhou", "ShenZhen"],
    "sex": ["male", "male", "female", "male"]
}

user_info = pd.DataFrame(data=data, index=index)
user_info

       age       city     sex
name
Tom     18    BeiJing    male
Bob     30   ShangHai    male
Mary    25  GuangZhou  female
James   40   ShenZhen    male

In [70]:
user_info.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Tom to James
Data columns (total 3 columns):
age     4 non-null int64
city    4 non-null object
sex     4 non-null object
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [71]:
user_info.head(2)

      age      city   sex
name
Tom    18   BeiJing  male
Bob    30  ShangHai  male

In [72]:
user_info.tail(2)

       age       city     sex
name
Mary    25  GuangZhou  female
James   40   ShenZhen    male

In [73]:
user_info.shape

(4, 3)

In [74]:
user_info.T

name      Tom       Bob       Mary     James
age        18        30         25        40
city  BeiJing  ShangHai  GuangZhou  ShenZhen
sex      male      male     female      male

In [75]:
user_info.values

array([[18, 'BeiJing', 'male'],
       [30, 'ShangHai', 'male'],
       [25, 'GuangZhou', 'female'],
       [40, 'ShenZhen', 'male']], dtype=object)

In [76]:
user_info.age.max()

40

In [77]:
user_info.describe()

             age
count   4.000000
mean   28.250000
std     9.251126
min    18.000000
25%    23.250000
50%    27.500000
75%    32.500000
max    40.000000